# 전자제조데이터분석 과제 02
## 제출: eclass 과제메뉴 02
- 각 코드 블럭의 출력 결과까지 저장하여 제출해주세요.
- 최대한 본인의 힘으로 해결하세요. (중간고사과 유사한 스타일)
- 각 코드의 동작방식을 반드시! 주석으로 설명해주세요.
- ipynb 파일을 그대로 제출해주세요.

##기한: 2021.10.23 23:59

학번: 21512023
이름: 정주현

참고해야 할 문서: Padnas API Reference 

https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/index.html

팁:
- read_csv(): csv 파일을 읽기 위한 메소드 (https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/api/pandas.read_csv.html#pandas.read_csv)
- dataframe.*: dataframe을 다루기 위한 다양한 메소드 (https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/frame.html)



### Step 1. pandas 모듈을 import 하세요.

In [1]:
import pandas as pd #pandas 모듈을 pd란 이름으로 import

### Step 2. 제공된 데이터 파일을 업로드하세요.

In [2]:
from google.colab import files
file_uploaded = files.upload() # 파일 업로드

Saving w6data.txt to w6data.txt

### Step 3. 업로드한 파일을 읽어 dataframe을 추출한 후 (pd.read_csv() 활용), 특정 변수에 저장하세요. 이때, 'user_id' 열을 dataframe의 인덱스로 활용하세요.

In [3]:
data = pd.read_csv('w6data.txt', index_col='user_id') #pd.read_csv를 활용하여 txt파일 불러옴, index_col로 user_id 열을 index로 지정
data

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. 첫 25개 항목을 출력하세요.

In [4]:
data.head(25) # 첫 25개 항목 출력

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. 마지막 10개 항목을 출력하세요.

In [5]:
data.tail(10) # 마지막 10개 항목 출력

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. 데이터 파일에 총 몇개의 항목이 존재하는지 구해보세요.

In [6]:
len(data) # data의 길이 구함.

943

### Step 7. Dataframe에 몇 개의 열(column)이 존재하나요?

In [7]:
len(data.columns) # data의 column 길이 구함

4

### Step 8. Dataframe 내 모든 열(column)의 이름을 출력해보세요.

In [8]:
print(data.columns) #data의 column에 해당하는 이름 출력

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. Dataframe의 인덱싱이 어떻게 되어있는지 출력해보세요.

In [9]:
# "the index" (aka "the labels")
print(data.index) #data의 index를 출력함.

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. 각 열(column)의 data type을 출력해보세요.

In [10]:
data.dtypes # data의 각 열의 type을 출력함.

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. occupation 열(column)만 출력해보세요.

In [11]:
print(data['occupation']) #dataframe(data)의 특정(occupation) 열 출력함.

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. 데이터 파일에 몇 개의 서로 다른 occupation이 존재하나요?

In [12]:
# 두가지로 풀 수 있음.
# len(set(data['occupation']))  # occupation열을 집합으로 만들고(집합은 중복허용 하지 않음), 그 길이를 구함
len(data['occupation'].value_counts()) # value_counts() : 값별로 데이터의 수를 출력함, occupation열의 값별로 데이터 수를 출력하고, 그 길이를 구함

21

### Step 13. 가장 많이 등장하는 occupation은 무엇인가요?

In [13]:
data['occupation'].value_counts().sort_values(ascending=False).index[0]
# value_counts() : 값별로 데이터의 수를 출력
# sort_values(ascending=False) 값을 내림차순으로 정렬함.
# value_counts()의 index는 값, value는 데이터 수임. 내림차순으로 정렬했으니 첫번째 행의 index값을 확인
# 답 : student

'student'

### Step 14. Dataframe내 모든 열(column)에 대하여 다양한 통계정보를 출력해보세요.

In [14]:
data.describe(include='all') 
# 각 열의 통계를 찾으려 함. pd.DataFrame.describe() 함수 이용
# 모든 열을 출력 : include= ' all'

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 15. 사용자들의 평균 나이는 몇살인가요?

In [15]:
round(data['age'].mean()) # age 열의 평균을 구함, 소수 첫째자리를 반올림

34

### Step 16. 가장 적게 등장한 사용자들 중 최연소자의 나이는 몇인가요?

In [27]:
#가장 적게 등장한 나이 중 최연소 나이
age_value = data['age'].value_counts() # age열의 값별로 데이터 수 출력한 결과를 age_value에 저장
min(age_value[age_value == min(age_value)].index) # age_value에서 최소값들을 추출하고, 그것들의 index를 뽑아냄. 그럼 가장 적게 등장한 나이가 나옴. 그 index들의 최솟값을 구함

7